category_names = [
    float('nan'),
    'Duty Free', 'Авиабилеты', 'Автоуслуги', 'Аптеки', 'Аренда авто', 'Госсборы',
    'Дом/Ремонт', 'Ж/д билеты', 'Животные', 'Искусство', 'Кино', 'Книги', 'Красота', 'Медицинские услуги',
    'Музыка', 'НКО', 'Наличные', 'Образование', 'Одежда/Обувь', 'Отели', 'Развлечения', 'Разные товары',
    'Рестораны', 'Связь/Телеком', 'Сервисные услуги', 'Спорттовары', 'Сувениры', 'Супермаркеты',
    'Топливо', 'Транспорт', 'Турагентства', 'Фаст Фуд', 'Финансовые услуги', 'Фото/Видео', 'Цветы',
    'Частные услуги'
]
# 0 - most important, 20 - least important

importance = {
    float('nan'): 0,
    'nan': 0,
    'nan': 0,
    'NaN': 0,
    'Duty Free': 10,
    'Авиабилеты': 10,
    'Автоуслуги': 5,
    'Аптеки': 1,
    'Аренда авто': 4,
    'Госсборы': 2,
    'Дом/Ремонт': 8,
    'Ж/д билеты': 8,
    'Животные': 6, 'Искусство': 10, 'Кино': 10, 'Книги': 12, 'Красота': 6,
    'Медицинские услуги': 1,
    'Музыка': 12, 'НКО': 14, 'Наличные': 3, 'Образование': 8, 'Одежда/Обувь': 8, 'Отели': 14, 'Развлечения': 16,
    'Разные товары': 8,
    'Рестораны': 10, 'Связь/Телеком': 4, 'Сервисные услуги': 3, 'Спорттовары': 8, 'Сувениры': 16, 'Супермаркеты': 3,
    'Топливо': 5, 'Транспорт': 4, 'Турагентства': 12, 'Фаст Фуд': 14, 'Финансовые услуги': 9, 'Фото/Видео': 14,
    'Цветы': 10,
    'Частные услуги': 3
}
