category_names = [
    float('nan'),
    'Duty Free', 'Авиабилеты', 'Автоуслуги', 'Аптеки', 'Аренда авто', 'Госсборы',
    'Дом/Ремонт', 'Ж/д билеты', 'Животные', 'Искусство', 'Кино', 'Книги', 'Красота', 'Медицинские услуги',
    'Музыка', 'НКО', 'Наличные', 'Образование', 'Одежда/Обувь', 'Отели', 'Развлечения', 'Разные товары',
    'Рестораны', 'Связь/Телеком', 'Сервисные услуги', 'Спорттовары', 'Сувениры', 'Супермаркеты',
    'Топливо', 'Транспорт', 'Турагентства', 'Фаст Фуд', 'Финансовые услуги', 'Фото/Видео', 'Цветы',
    'Частные услуги'
]
